# Stepick.org — Алгоритмы: теория и практика. Структуры данных
# 2. Очереди с приоритетом и системы непересекающихся множеств

from sys import stdin

# === Задача 1 ===


def m_2_3_1(data):
    """Задача 1. Построение кучи"""
    pass


# print(m_2_3_1(stdin.read()))


# === Задача 2 ===


def m_2_3_2(data):
    """Задача 2. Параллельная обработка"""
    pass


# print(m_2_3_2(stdin.read()))


# === Задача 3 ===


def m_2_3_3(data):
    """Задача 3. Объединение таблиц"""
    pass


# print(m_2_3_3(stdin.read()))


# === Задача 4 ===


def m_2_3_4(data):
    """Задача 4. Автоматический анализ программ"""
    pass


# print(m_2_3_4(stdin.read()))
